### [Aula 02 - Ciência de Dados](./slides/Aula%2002-%20CD.pdf)

In [2]:
import pandas as pd
import numpy as np

In [3]:
#gerando listas
list_people = [['Gil',35],['Ana',25],['Paulo',30],['Maria',40],['João',20]]

In [4]:
list_people

[['Gil', 35], ['Ana', 25], ['Paulo', 30], ['Maria', 40], ['João', 20]]

In [5]:
# gerando um dataframe
df = pd.DataFrame(list_people, columns=['Name','Age'])

In [6]:
df

    Name  Age
0    Gil   35
1    Ana   25
2  Paulo   30
3  Maria   40
4   João   20

In [7]:
# Dataframe default
matrix_defaulf_df = pd.DataFrame(data=[[1,2,3],[4,5,6],[7,8,9]], columns=['A','B','C'])
matrix_defaulf_df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [8]:
matrix_defaulf_df.loc[0]

A    1
B    2
C    3
Name: 0, dtype: int64

In [15]:
matrix_defaulf_df.iloc[0:]

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9